Repository: dogdreamson555/PicForLater
Catalog: src/PicForLater.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# ApiConsentConsequencesText
source: Consent is versioned for this provider and payload mode. Changing provider, endpoint, policy scope, or mode requires confirmation again. Provider failure never changes mode or provider automatically.
zh_cn: 同意按供应商和载荷模式版本化。供应商、endpoint、政策范围或模式变化后必须重新确认；供应商失败时绝不会自动改变模式或供应商。
zh_tw: 同意內容會依供應商與傳送模式建立版本。供應商、端點、政策範圍或模式變更後必須重新確認；供應商發生錯誤時，絕不會自動變更模式或供應商。

# ApiSettingsUnavailableStatus
source: API settings are unavailable until local storage is ready.
zh_cn: 本地存储就绪前无法使用 API 设置。
zh_tw: 本機儲存空間就緒前無法使用 API 設定。

# ApiCredentialSavedStatus
source: Credential saved. Remote execution returned to Local until this key passes a synthetic test.
zh_cn: 凭据已保存。此密钥通过合成测试前，执行目标保持本地。
zh_tw: 認證資訊已儲存。此金鑰通過合成測試前，執行目標保持本機。

# ApiCredentialDeletedStatus
source: Credential and consent deleted. Requests not yet sent are blocked and new jobs use Local.
zh_cn: 凭据和同意已删除，尚未发送的请求已阻止，新任务使用本地。
zh_tw: 認證資訊和同意已刪除，尚未傳送的請求已阻止，新工作使用本機。

# ApiCredentialRequiredStatus
source: Save a credential before testing this profile.
zh_cn: 测试此 profile 前请先保存凭据。
zh_tw: 測試此設定檔前請先儲存認證資訊。

# ApiConnectionSucceededStatus
source: The provider returned a compatible structured result for the selected synthetic payload.
zh_cn: 供应商已针对所选合成载荷返回兼容的结构化结果。
zh_tw: 供應商已針對所選測試內容，回傳符合要求的結構化結果。

# ApiConnectionCredentialRejectedStatus
source: The provider rejected the credential. It will not be retried automatically.
zh_cn: 供应商拒绝了凭据，不会自动重试。
zh_tw: 供應商拒絕了認證資訊，不會自動重試。

# ApiConnectionRateLimitedStatus
source: The synthetic test was rate-limited. Review provider limits before trying again.
zh_cn: 合成测试被限流；再次尝试前请核对供应商限制。
zh_tw: 合成測試受到速率限制；再次嘗試前請核對供應商限制。

# ApiConnectionTimedOutStatus
source: The synthetic test timed out and may still have been processed or charged. It was not resent.
zh_cn: 合成测试超时，仍可能已处理或计费；应用没有重新发送。
zh_tw: 合成測試逾時，仍可能已處理或計費；應用程式沒有重新傳送。

# ApiConnectionNetworkFailedStatus
source: The synthetic test could not reach the current API address.
zh_cn: 合成测试无法连接当前 API 地址。
zh_tw: 合成測試無法連線目前 API 位址。

# ApiConnectionModelRejectedStatus
source: The provider rejected the model, selected input mode, or strict output schema.
zh_cn: 供应商拒绝了模型、所选输入模式或严格输出 schema。
zh_tw: 供應商拒絕了模型、所選輸入模式或嚴格輸出結構描述。

# ApiConnectionSchemaFailedStatus
source: The provider replied, but its result did not satisfy PicForLater's strict structured schema.
zh_cn: 供应商已响应，但结果不符合 PicForLater 的严格结构化 schema。
zh_tw: 供應商已回應，但結果不符合 PicForLater 的嚴格輸出結構描述。

# ApiConnectionFailedStatus
source: The synthetic test failed. No user image or OCR text was sent.
zh_cn: 合成测试失败；没有发送用户图片或 OCR 文字。
zh_tw: 合成測試失敗；沒有傳送使用者圖片或 OCR 文字。

# ApiConnectionTestRequiredStatus
source: Run a successful synthetic test for this provider, model, and payload mode before enabling it.
zh_cn: 启用前请先让此供应商、模型和载荷模式通过合成测试。
zh_tw: 啟用前請先讓此供應商、模型和傳送模式通過合成測試。

# ApiRemoteEnabledStatus
source: Remote analysis is enabled for new jobs with the selected provider and payload mode.
zh_cn: 已为新任务启用所选供应商和载荷模式的远程分析。
zh_tw: 已為新工作啟用所選供應商和傳送模式的遠端分析。

# ApiLocalSelectedStatus
source: New jobs now use Local. Requests not yet sent are blocked.
zh_cn: 新任务已切回本地，尚未发送的请求已阻止。
zh_tw: 新工作已切回本機，尚未傳送的請求已阻止。

# ApiConsentRevokedStatus
source: Consent revoked and new jobs returned to Local. Content already received by a provider cannot be recalled.
zh_cn: 同意已撤销，新任务已切回本地；供应商已经收到的内容无法召回。
zh_tw: 同意已撤銷，新工作已切回本機；供應商已經收到的內容無法收回。

# ApiOperationFailedStatus
source: The API setting could not be updated. No privacy boundary was changed.
zh_cn: 未能更新 API 设置；隐私边界没有改变。
zh_tw: 未能更新 API 設定；隱私邊界沒有改變。

# ApiCategoryRowTitle.Text
source: Provider category
zh_cn: 供应商分类
zh_tw: 供應商分類

# ApiCategoryComboBox.AutomationProperties.Name
source: API provider category
zh_cn: API 供应商分类
zh_tw: API 供應商分類

# ApiCategoryInternational
source: International official APIs (5)
zh_cn: 国际主流模型官方 API（5）
zh_tw: 國際主流模型官方 API（5）

# ApiCategoryChina
source: China official APIs (8)
zh_cn: 中国主流模型官方 API（8）
zh_tw: 中國主流模型官方 API（8）

# ApiCategoryAggregator
source: Multi-model and high-speed platforms (4)
zh_cn: 多模型聚合与高速推理平台（4）
zh_tw: 多模型聚合與高速推理平台（4）

# ApiCategoryLocalPrivate
source: Local and private deployment (2)
zh_cn: 本地运行与私有化部署（2）
zh_tw: 本機執行與私有部署（2）

# ApiCategoryCustom
source: Custom interface
zh_cn: 自定义接口
zh_tw: 自訂介面

# GenericApiRetentionStatement
source: Retention and training treatment depends on the provider, plan, region, and current account controls. Review the linked provider policies before consenting.
zh_cn: 数据保留和训练处理取决于供应商、套餐、地区和当前账户控制；同意前请查看链接中的供应商政策。
zh_tw: 資料保留和訓練處理取決於供應商、方案、地區和目前帳戶控制；同意前請檢視連結中的供應商政策。

# LoopbackApiRetentionStatement
source: Requests use only the selected loopback service on this device. Storage and model behavior are controlled by that local server.
zh_cn: 请求只发送给本机所选 loopback 服务；存储与模型行为由该本地服务控制。
zh_tw: 請求只會傳送至本機選取的回送服務；儲存與模型行為由該本機服務控制。

# CustomApiRetentionStatement
source: PicForLater cannot verify a custom service's owner, retention, training, or pricing. Verify the endpoint and its policies yourself before testing or consenting.
zh_cn: PicForLater 无法验证自定义服务的所有者、保留、训练或价格政策；测试和同意前请自行核验 endpoint 与政策。
zh_tw: PicForLater 無法驗證自訂服務的擁有者、保留、訓練或價格政策；測試和同意前請自行確認端點與相關政策。

# ApiCredentialNotRequiredState
source: This loopback/custom profile does not send an authentication credential.
zh_cn: 此 loopback/自定义 profile 不发送鉴权凭据。
zh_tw: 此回送或自訂設定檔不會傳送認證資訊。

# ApiCustomInterfaceTitle.Text
source: Custom compatibility contract
zh_cn: 自定义兼容契约
zh_tw: 自訂相容契約

# ApiCustomEndpointTextBox.Header
source: Complete POST endpoint
zh_cn: 完整 POST endpoint
zh_tw: 完整 POST 端點

# ApiCustomProtocolComboBox.Header
source: Request protocol
zh_cn: 请求协议
zh_tw: 請求通訊協定

# ApiCustomAuthenticationComboBox.Header
source: Authentication
zh_cn: 鉴权方式
zh_tw: 驗證方式

# ApiAuthenticationNone.Content
source: None (loopback only recommended)
zh_cn: 无（建议仅用于 loopback）
zh_tw: 無（建議僅用於回送服務）

# ApiCustomStructuredOutputComboBox.Header
source: Structured output
zh_cn: 结构化输出
zh_tw: 結構化輸出

# ApiCustomEndpointTrustComboBox.Header
source: Network boundary
zh_cn: 网络边界
zh_tw: 網路邊界

# ApiEndpointTrustPublicHttps.Content
source: Public HTTPS only
zh_cn: 仅公共 HTTPS
zh_tw: 僅公用 HTTPS

# ApiEndpointTrustLoopback.Content
source: Loopback HTTP/HTTPS only
zh_cn: 仅 loopback HTTP/HTTPS
zh_tw: 僅限回送服務使用 HTTP/HTTPS

# ApiCustomEndpointSafetyInfoBar.Title
source: Restricted custom endpoint
zh_cn: 受限的自定义 endpoint
zh_tw: 受限的自訂端點

# ApiCustomEndpointSafetyInfoBar.Message
source: Public mode requires HTTPS and blocks loopback/private/link-local destinations after DNS resolution. Loopback mode accepts only localhost, 127.0.0.1, or ::1. Redirects are rejected.
zh_cn: 公共模式要求 HTTPS，并在 DNS 解析后阻止 loopback、私网和链路本地地址；loopback 模式只接受 localhost、127.0.0.1 或 ::1。重定向一律拒绝。
zh_tw: 公用模式要求 HTTPS，並在 DNS 解析後阻止回送、私人網路和連結-本機位址；回送模式只接受 localhost、127.0.0.1 或 ::1。重新導向一律拒絕。

# SaveCustomApiProfileButton.Content
source: Save custom contract
zh_cn: 保存自定义契约
zh_tw: 儲存自訂契約

# SaveCustomApiProfileButton.AutomationProperties.Name
source: Save custom API compatibility contract
zh_cn: 保存自定义 API 兼容契约
zh_tw: 儲存自訂 API 相容契約

# ApiCustomProfileSavedStatus
source: Custom contract saved. Remote sending remains Local until the selected synthetic test succeeds and consent is confirmed.
zh_cn: 自定义契约已保存；所选合成测试通过且确认同意前，远程发送仍保持本地。
zh_tw: 自訂契約已儲存；所選合成測試通過且確認同意前，遠端傳送仍保持本機。

# ApiStructuredOutputPromptOnly.Content
source: Prompt contract only (broader compatibility)
zh_cn: 仅提示词约束（兼容性较广）
zh_tw: 僅提示詞約束（相容性較廣）

# ApiAdvancedSettingsExpander.Header
source: Advanced model parameters
zh_cn: 高级模型参数
zh_tw: 進階模型參數

# ApiReasoningRowTitle.Text
source: Reasoning effort
zh_cn: 思考规模
zh_tw: 思考規模

# ApiReasoningModeComboBox.AutomationProperties.Name
source: Model reasoning effort
zh_cn: 模型思考规模
zh_tw: 模型思考規模

# ApiReasoningProviderDefault
source: Provider default
zh_cn: 供应商默认
zh_tw: 供應商預設

# ApiReasoningDisabled
source: Disabled (recommended for structured output)
zh_cn: 关闭（结构化输出推荐）
zh_tw: 關閉（結構化輸出建議）

# ApiReasoningLow
source: Low
zh_cn: 低
zh_tw: 低

# ApiReasoningMedium
source: Medium
zh_cn: 中
zh_tw: 中

# ApiReasoningHigh
source: High
zh_cn: 高
zh_tw: 高

# ApiReasoningWireFormatComboBox.Header
source: Custom interface reasoning parameter format
zh_cn: 自定义接口思考参数格式
zh_tw: 自訂介面思考參數格式

# ApiReasoningWireNone.Content
source: Do not send a reasoning parameter
zh_cn: 不发送思考参数
zh_tw: 不傳送思考參數

# ApiMaxOutputTokensRowTitle.Text
source: Maximum output tokens
zh_cn: 最大输出 token
zh_tw: 最大輸出 token

# ApiTimeoutRowTitle.Text
source: Request timeout (seconds)
zh_cn: 请求超时（秒）
zh_tw: 請求逾時（秒）

# ApiAdvancedSettingsDescription.Text
source: Saving any change invalidates connection verification and prior consent. Higher reasoning, token, or timeout values may increase latency and cost.
zh_cn: 保存任何更改都会使连接验证和旧同意失效；提高思考规模、token 或超时可能增加延迟和费用。
zh_tw: 儲存任何變更都會使連線驗證和舊同意失效；提高思考規模、token 或逾時可能增加延遲和費用。

# SaveApiAdvancedSettingsButton.Content
source: Save advanced settings
zh_cn: 保存高级设置
zh_tw: 儲存進階設定

# SaveApiAdvancedSettingsButton.AutomationProperties.Name
source: Save advanced API model parameters
zh_cn: 保存 API 高级模型参数
zh_tw: 儲存 API 進階模型參數

# ApiAdvancedSettingsSavedStatus
source: Advanced parameters saved. New work remains Local until the connection is tested again and consent is confirmed.
zh_cn: 高级参数已保存；已切回本地，重新测试连接并确认同意后才会发送内容。
zh_tw: 進階參數已儲存；已切回本機，重新測試連線並確認同意後才會傳送內容。

# ApiConnectionContentFailedStatus
source: The provider returned a structured object, but its title or summary was empty or not grounded in the input, so it failed PicForLater's draft quality check. Keep reasoning disabled and verify that the model follows instructions before retrying.
zh_cn: 供应商返回了结构化对象，但标题/简介为空或内容没有依据输入；未通过 PicForLater 的草稿质量检查。可保持关闭思考、确认模型支持指令遵循后重试。
zh_tw: 供應商回傳了結構化物件，但標題/簡介為空或內容沒有依據輸入；未通過 PicForLater 的草稿品質檢查。建議先關閉推理功能，確認模型支援指令遵循後再重試。

# RecommendedPpOcrDisplayName
source: Enhanced OCR
zh_cn: 增强 OCR
zh_tw: 增強 OCR

# RecommendedQwenCpuDisplayName
source: CPU vision model
zh_cn: CPU 视觉模型
zh_tw: CPU 視覺模型

# RecommendedQwenCudaDisplayName
source: NVIDIA GPU vision model
zh_cn: NVIDIA GPU 视觉模型
zh_tw: NVIDIA GPU 視覺模型

# RecommendedLocalModelDisplayName
source: Local model
zh_cn: 本地模型
zh_tw: 本機模型

# RecommendedModelDetailsExpander.Header
source: Implementation, size, and license
zh_cn: 实现、体积与许可证
zh_tw: 實作、大小與授權條款

# InstalledOcrModelDisplayName
source: Installed enhanced OCR
zh_cn: 已安装的增强 OCR
zh_tw: 已安裝的增強 OCR

# InstalledVisionModelDisplayName
source: Installed vision model
zh_cn: 已安装的视觉模型
zh_tw: 已安裝的視覺模型

# InstalledLocalModelDisplayName
source: Installed local model
zh_cn: 已安装的本地模型
zh_tw: 已安裝的本機模型

# InstalledModelDetailsExpander.Header
source: Technical details
zh_cn: 技术详情
zh_tw: 技術詳細資料

# RecommendedModelInfoButton.AutomationProperties.Name
source: View recommended model details
zh_cn: 查看推荐模型详情
zh_tw: 檢視建議模型詳細資料

# RecommendedModelInfoButton.ToolTipService.ToolTip
source: Implementation, size, and license
zh_cn: 实现、体积与许可证
zh_tw: 實作、大小與授權條款

# InstalledModelInfoButton.AutomationProperties.Name
source: View installed model details
zh_cn: 查看已安装模型详情
zh_tw: 檢視已安裝模型詳細資料

# InstalledModelInfoButton.ToolTipService.ToolTip
source: View technical details
zh_cn: 查看技术详情
zh_tw: 檢視技術詳細資料

# ModelPackagesSectionTitle.Text
source: Model packages
zh_cn: 模型包
zh_tw: 模型套件

# AdvancedSettingsSectionTitle.Text
source: Advanced settings
zh_cn: 高级设置
zh_tw: 進階設定

# AdvancedSettingsSectionDescription.Text
source: Capability slots and model packages
zh_cn: 能力槽位与模型包
zh_tw: 能力槽位與模型套件

# InstalledModelsExpander.AutomationProperties.Name
source: Installed model packages
zh_cn: 已安装模型包
zh_tw: 已安裝模型套件

# InstalledModelsExpander.AutomationProperties.HelpText
source: Expand installed model packages
zh_cn: 展开已安装模型包
zh_tw: 展開已安裝模型套件

# InstalledModelsExpandHelpText
source: Expand installed model packages
zh_cn: 展开已安装模型包
zh_tw: 展開已安裝模型套件

# InstalledModelsCollapseHelpText
source: Collapse installed model packages
zh_cn: 收起已安装模型包
zh_tw: 收起已安裝模型套件

# ApiConfigurationSectionTitle.Text
source: API configuration
zh_cn: API 配置
zh_tw: API 設定

# ApiConfigurationSectionDescription.Text
source: Choose the provider, model, payload boundary, and credential. Editing configuration never enables remote analysis by itself.
zh_cn: 选择供应商、模型、发送范围和凭据。修改配置不会自动启用联网分析。
zh_tw: 選擇供應商、模型、傳送範圍和認證資訊。修改設定不會自動啟用聯網分析。

# ApiCustomInterfaceExpander.Header
source: Custom interface contract
zh_cn: 自定义接口契约
zh_tw: 自訂介面契約

# ApiConsentSectionTitle.Text
source: Confirm payload and enable
zh_cn: 确认发送范围并启用
zh_tw: 確認傳送範圍並啟用

# ApiPolicyExpander.Header
source: Review provider policy, limits, and cost
zh_cn: 查看供应商政策、限制与费用
zh_tw: 檢視供應商政策、限制與費用

# ApiConsentMissingState
source: No consent exists for the current provider and payload mode. User content is not sent even after a successful connection test.
zh_cn: 尚未同意当前供应商和载荷模式；即使连接测试通过，也不会发送用户内容。
zh_tw: 尚未同意目前供應商和傳送模式；即使連線測試通過，也不會傳送使用者內容。

# ApiConsentGrantedFormat
source: Consent is current for “{0}”.
zh_cn: 已同意“{0}”的当前披露版本。
zh_tw: 已同意「{0}」的目前揭露版本。

# ApiConsentDifferentModeState
source: Consent applies to another payload mode. Review and confirm again after switching.
zh_cn: 同意适用于另一个载荷模式；切换后需要重新核对并确认。
zh_tw: 同意適用於另一個傳送模式；切換後需要重新核對並確認。

# InstalledModelsEmptyText.Text
source: Installed model packages will appear here.
zh_cn: 安装后的模型包会显示在这里。
zh_tw: 安裝後的模型套件會顯示在這裡。

# ApiProviderSectionDescription.Text
source: Choose a provider and model. Changing a selection never enables network analysis by itself.
zh_cn: 选择供应商和模型。切换选择不会自动启用联网分析。
zh_tw: 選擇供應商和模型。切換選擇不會自動啟用聯網分析。

# ApiCredentialCardTitle.Text
source: Windows Credential Locker
zh_cn: Windows 凭据保险箱
zh_tw: Windows 認證保管庫

# ApiAdvancedSectionTitle.Text
source: Advanced settings
zh_cn: 高级设置
zh_tw: 進階設定

# ApiAdvancedSectionDescription.Text
source: Adjust the API address, model reasoning parameters, and timeout. Test again after saving.
zh_cn: 调整 API 地址、模型推理参数和超时；更改后需要重新测试。
zh_tw: 調整 API 位址、模型推理參數和逾時；變更後需要重新測試。

# ApiEndpointRowTitle.Text
source: Complete API address
zh_cn: 完整 API 地址
zh_tw: 完整 API 位址

# ApiEndpointTextBox.AutomationProperties.Name
source: Complete API address
zh_cn: 完整 API 地址
zh_tw: 完整 API 位址

# ApiEndpointEditDescription.Text
source: Public HTTPS and loopback addresses are supported. Changing the address invalidates the current test and consent and requires a risk confirmation before saving.
zh_cn: 支持公共 HTTPS 或本机 loopback 地址。更改地址会使当前测试与同意失效，并在保存前要求确认风险。

# ApiCustomContractSectionTitle.Text
source: Custom interface contract
zh_cn: 自定义接口契约
zh_tw: 自訂介面契約

# ApiCustomContractSectionDescription.Text
source: Only a custom interface must declare the request protocol, authentication, structured output, and network boundary.
zh_cn: 仅自定义接口需要声明请求协议、鉴权、结构化输出和网络边界。
zh_tw: 僅自訂介面需要宣告請求通訊協定、驗證、結構化輸出和網路邊界。

# ApiEndpointChangeDialogTitle
source: Change the API address?
zh_cn: 更改 API 地址？
zh_tw: 變更 API 位址？

# ApiEndpointChangeDialogMessageFormat
source: API requests and credentials will move from “{0}” to “{1}”. Verify the service owner, cost, and privacy policy. The app will still reject redirects and unsafe network destinations.
zh_cn: API 请求和密钥将从“{0}”改为发送到“{1}”。请确认服务所有者、费用与隐私政策；应用仍会拒绝重定向和不安全的网络目标。
zh_tw: API 請求和金鑰將從「{0}」改為傳送至「{1}」。請確認服務擁有者、費用與隱私政策；應用程式仍會拒絕重新導向和不安全的網路目標。

# ApiEndpointChangeDialogPrimary
source: Change anyway
zh_cn: 仍要更改
zh_tw: 仍要變更

# ApiAdvancedSettingsSaveRequiredStatus
source: Save advanced settings before testing the connection.
zh_cn: 请先保存高级设置，再测试连接。
zh_tw: 請先儲存進階設定，再測試連線。

# LocalInferenceComponentSectionTitle.Text
source: Optional local analysis component
zh_cn: 可选本地分析组件
zh_tw: 選用本機分析元件

# LocalInferenceComponentSectionDescription.Text
source: The core app excludes ONNX and GenAI runtimes. Download this executable component from the official GitHub Release only when you want local analysis; cloud API analysis does not need it.
zh_cn: 核心应用不携带 ONNX 和 GenAI 运行库。仅在需要本地分析时，从官方 GitHub Release 下载这一可执行组件；云端 API 分析不需要它。
zh_tw: 核心應用程式不隨附 ONNX 和 GenAI 執行階段函式庫。僅在需要本機分析時，從官方 GitHub Release 下載這一可執行元件；雲端 API 分析不需要它。

# LocalInferenceComponentStatusTitle.Text
source: Local execution component
zh_cn: 本地执行组件
zh_tw: 本機執行元件

# InstallLocalInferenceComponentButton.AutomationProperties.Name
source: Install or repair the local analysis component
zh_cn: 安装或修复本地分析组件
zh_tw: 安裝或修復本機分析元件

# RemoveLocalInferenceComponentButton.Content
source: Remove
zh_cn: 移除
zh_tw: 移除

# RemoveLocalInferenceComponentButton.AutomationProperties.Name
source: Remove the local analysis component
zh_cn: 移除本地分析组件
zh_tw: 移除本機分析元件

# LocalInferenceComponentInstallAction
source: Download and install
zh_cn: 下载并安装
zh_tw: 下載並安裝

# LocalInferenceComponentRepairAction
source: Check for update or repair
zh_cn: 检查更新或修复
zh_tw: 檢查更新或修復

# LocalInferenceComponentInstalledStatusFormat
source: Version {0} is installed and verified.
zh_cn: 已安装并验证版本 {0}。
zh_tw: 已安裝並驗證版本 {0}。

# LocalInferenceComponentNotInstalledStatus
source: Not installed. Cloud API analysis remains available.
zh_cn: 尚未安装；云端 API 分析仍可使用。
zh_tw: 尚未安裝；雲端 API 分析仍可使用。

# LocalInferenceComponentTrustUnavailableStatus
source: Not installed. Secure download is unavailable until the release signing public key is configured; cloud API analysis remains available.
zh_cn: 尚未安装。发布签名公钥配置完成前，安全下载暂不可用；云端 API 分析仍可使用。
zh_tw: 尚未安裝。發佈簽章公鑰設定完成前，安全下載暫時無法使用；雲端 API 分析仍可使用。

# LocalInferenceComponentInstallDialogTitle
source: Download the local analysis component?
zh_cn: 下载本地分析组件？
zh_tw: 下載本機分析元件？

# LocalInferenceComponentInstallConfirmation
source: This downloads a large architecture-specific executable component from the official PicForLater GitHub Release. The signed release manifest, archive size and SHA-256, and every installed file are checked before atomic activation. No image, OCR text, model input, API key, or other user content is uploaded.
zh_cn: 这会从 PicForLater 官方 GitHub Release 下载体积较大的架构专用可执行组件。应用会先验证签名发布清单、压缩包体积与 SHA-256，并逐文件复验后再原子激活。不会上传图片、OCR 文本、模型输入、API 密钥或其他用户内容。
zh_tw: 這會從 PicForLater 官方 GitHub Release 下載大小較大的架構專用可執行元件。應用程式會先驗證簽章發佈清單、壓縮檔大小與 SHA-256，並逐檔案複驗後再安全啟用。不會上傳圖片、OCR 文字、模型輸入、API 金鑰或其他使用者內容。

# LocalInferenceComponentRemoveDialogTitle
source: Remove the local analysis component?
zh_cn: 移除本地分析组件？
zh_tw: 移除本機分析元件？

# LocalInferenceComponentRemoveConfirmationFormat
source: Remove local execution component version {0}? Local model packages, images, analysis results, settings, and cloud API configuration are kept. Local analysis remains unavailable until the component is installed again.
zh_cn: 移除本地执行组件版本 {0}？本地模型包、图片、分析结果、设置和云端 API 配置都会保留。重新安装组件前，本地分析将不可用。
zh_tw: 移除本機執行元件版本 {0}？本機模型套件、圖片、分析結果、設定和雲端 API 設定都會保留。重新安裝元件前，本機分析將無法使用。

# LocalInferenceComponentRemoveAction
source: Remove component
zh_cn: 移除组件
zh_tw: 移除元件

# LocalInferenceComponentInstalledSuccessFormat
source: Local analysis component version {0} was verified and activated.
zh_cn: 本地分析组件版本 {0} 已验证并激活。
zh_tw: 本機分析元件版本 {0} 已驗證並啟用。

# LocalInferenceComponentAlreadyCurrentFormat
source: Local analysis component version {0} is already current and verified.
zh_cn: 本地分析组件版本 {0} 已是当前版本且验证通过。
zh_tw: 本機分析元件版本 {0} 已是目前版本且驗證通過。

# LocalInferenceComponentCanceledStatus
source: The component operation was canceled. The current component was kept.
zh_cn: 组件操作已取消，当前组件保持不变。
zh_tw: 元件操作已取消，目前元件不會變更。

# LocalInferenceComponentRemovingStatus
source: Stopping local analysis and removing the execution component…
zh_cn: 正在停止本地分析并移除执行组件…
zh_tw: 正在停止本機分析並移除執行元件…

# LocalInferenceComponentRemovedStatus
source: The local analysis component was removed. Models and user data were kept.
zh_cn: 本地分析组件已移除；模型和用户数据已保留。
zh_tw: 本機分析元件已移除；模型和使用者資料已保留。

# LocalInferenceComponentRemoveFailedStatus
source: The local analysis component could not be removed. Its previous state was restored when possible.
zh_cn: 无法移除本地分析组件；已尽可能恢复之前的状态。
zh_tw: 無法移除本機分析元件；已盡可能還原之前的狀態。

# LocalInferenceComponentPreparingStatus
source: Downloading and authenticating the signed component manifest…
zh_cn: 正在下载并认证已签名的组件清单…
zh_tw: 正在下載並驗證已簽章的元件清單…

# LocalInferenceComponentDownloadingStatus
source: Downloading the local analysis component…
zh_cn: 正在下载本地分析组件…
zh_tw: 正在下載本機分析元件…

# LocalInferenceComponentVerifyingStatus
source: Checking archive and installed file integrity…
zh_cn: 正在检查压缩包和安装文件完整性…
zh_tw: 正在檢查壓縮檔和安裝檔案完整性…

# LocalInferenceComponentActivatingStatus
source: Stopping the old worker and atomically activating the verified component…
zh_cn: 正在停止旧 worker 并原子激活已验证组件…
zh_tw: 正在停止舊的背景工作程序並安全啟用已驗證的元件…

# LocalInferenceComponentCompletingStatus
source: Finishing the local analysis component operation…
zh_cn: 正在完成本地分析组件操作…
zh_tw: 正在完成本機分析元件操作…

# LocalInferenceComponentInsufficientSpaceStatus
source: There is not enough free disk space for both the download and extracted component. The current component was kept.
zh_cn: 磁盘空间不足，无法同时容纳下载文件和解压后的组件；当前组件保持不变。
zh_tw: 磁碟空間不足，無法同時容納下載檔案和解壓縮後的元件；目前元件不會變更。

# LocalInferenceComponentDownloadTimedOutStatus
source: The component download timed out after no data was received. The partial staging data was cleaned.
zh_cn: 组件下载因长时间未收到数据而超时；不完整的 staging 数据已清理。
zh_tw: 元件下載因長時間未收到資料而逾時；不完整的暫存資料已清理。

# LocalInferenceComponentNetworkFailedStatus
source: The component could not be downloaded from GitHub. Try again when the network is stable.
zh_cn: 无法从 GitHub 下载组件；请在网络稳定后重试。
zh_tw: 無法從 GitHub 下載元件；請在網路穩定後重試。

# LocalInferenceComponentSignatureFailedStatus
source: The component release manifest did not have a valid trusted signature. Nothing was installed.
zh_cn: 组件发布清单没有有效的受信任签名，未安装任何内容。
zh_tw: 元件發佈清單沒有有效的受信任簽章，未安裝任何內容。

# LocalInferenceComponentVerificationFailedStatus
source: The signed manifest, source, size, SHA-256, archive layout, or installed files failed validation. The current component was kept.
zh_cn: 签名清单、来源、体积、SHA-256、压缩包布局或安装文件未通过验证；当前组件保持不变。
zh_tw: 簽章清單、來源、大小、SHA-256、壓縮檔版面配置或安裝檔案未通過驗證；目前元件不會變更。

# LocalInferenceComponentInstallFailedStatus
source: The local analysis component could not be installed or activated. The current component and user data were kept.
zh_cn: 无法安装或激活本地分析组件；当前组件和用户数据保持不变。
zh_tw: 無法安裝或啟用本機分析元件；目前元件與使用者資料不會變更。

# LocalInferenceComponentErrorCodeFormat
source: {0} Error code: {1}
zh_cn: {0} 错误代码：{1}
zh_tw: {0} 錯誤碼：{1}

# LocalSendSectionTitle.Text
source: Phone receive
zh_cn: 手机接收
zh_tw: 手機接收

# LocalSendReceiveToggleTitle.Text
source: Automatically receive images through LocalSend
zh_cn: 允许通过 LocalSend 自动接收图片
zh_tw: 允許透過 LocalSend 自動接收圖片

# LocalSendReceiveToggleDescription.Text
source: Enable this only on a trusted home or personal local network.
zh_cn: 仅建议在可信的家庭或个人局域网中开启。
zh_tw: 僅建議在受信任的家庭或個人區域網路中開啟。

# LocalSendAnalysisDisclosure.Text
source: Received images use the current analysis mode. API analysis may send them to the configured service.
zh_cn: 收到的图片会按当前分析方式处理；API 分析可能发送到已配置的服务。
zh_tw: 收到的圖片會依目前的分析方式處理；API 分析可能傳送至已設定的服務。

# LocalSendReceiveToggle.AutomationProperties.Name
source: Automatically receive images through LocalSend
zh_cn: 允许通过 LocalSend 自动接收图片
zh_tw: 允許透過 LocalSend 自動接收圖片

# LocalSendStatusInfoBar.Title
source: Phone receive status
zh_cn: 手机接收状态
zh_tw: 手機接收狀態

# BeginLocalSendPairingButton.Content
source: Pair a new device
zh_cn: 配对新设备
zh_tw: 配對新裝置

# BeginLocalSendPairingButton.AutomationProperties.Name
source: Pair a new device
zh_cn: 配对新设备
zh_tw: 配對新裝置

# LocalSendPairingInstructions.Text
source: Select PicForLater in LocalSend on your phone, then send at least one supported image.
zh_cn: 在手机 LocalSend 中选择 PicForLater，并发送至少一张支持的图片。
zh_tw: 在手機 LocalSend 中選擇 PicForLater，並傳送至少一張支援的圖片。

# LocalSendPairingPinLabel.Text
source: Temporary PIN
zh_cn: 临时 PIN
zh_tw: 暫時 PIN

# CancelLocalSendPairingButton.Content
source: Cancel pairing
zh_cn: 取消配对
zh_tw: 取消配對

# CancelLocalSendPairingButton.AutomationProperties.Name
source: Cancel the current phone pairing
zh_cn: 取消当前手机配对
zh_tw: 取消目前手機配對

# LocalSendTrustedDevicesTitle.Text
source: Trusted devices
zh_cn: 已信任设备
zh_tw: 受信任的裝置

# LocalSendTrustedDevicesEmpty.Text
source: No trusted device has been paired.
zh_cn: 尚未配对可信设备。
zh_tw: 尚未配對受信任的裝置。

# LocalSendTrustedDevicesList.AutomationProperties.Name
source: Trusted LocalSend devices
zh_cn: 已信任的 LocalSend 设备
zh_tw: 受信任的 LocalSend 裝置
